<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Empty recipe that simply uses the download recipe (as it downloads a pkg)</string>
	<key>Identifier</key>
	<string>com.github.lincolnep.recipes.pkg.AdoptOpenJDK13_Signed</string>
	<key>ParentRecipe</key>
	<string>com.github.lincolnep.recipes.download.AdoptOpenJDK13_Signed</string>
	<key>Input</key>
	<dict>
         <key>NAME</key>
         <string>AdoptOpenJDK-jdk-hotspot</string>
         <key>SOFTWARETITLE</key>
         <string>AdoptOpenJDK</string>
    </dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Arguments</key>
            <dict>
               <key>pattern</key>
               <string>%RECIPE_CACHE_DIR%/downloads/*%SOFTWARETITLE%*.pkg</string>
            </dict>
            <key>Processor</key>
            <string>FileFinder</string>
         </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/installer_payload</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/installer_payload/Library/Java/JavaVirtualMachines/adoptopenjdk-13.jdk/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>JVMPlatformVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
	</array>
</dict>
</plist>
