<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of AdoptOpenJDK 12 HotSpot. Recipe created by Charles Mission.</string>
	<key>Identifier</key>
	<string>com.github.lincolnep.recipes.download.AdoptOpenJDK12_Signed</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AdoptOpenJDK 12</string>
		<key>STOPPROCESSINGIF_PREDICATE</key>
		<string>download_changed == False</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>(?P&lt;match&gt;AdoptOpenJDK\/openjdk12-binaries\/releases\/download\/jdk12.*?\/OpenJDK12U-jdk_x64_mac_hotspot_.*?\.pkg)</string>
				<key>url</key>
				<string>https://github.com/AdoptOpenJDK/openjdk12-binaries/releases</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://github.com/%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>%STOPPROCESSINGIF_PREDICATE%</string>
			</dict>
			<key>Comment</key>
			<string>Checks if the file already exists in the cache</string>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: London Jamocha Community CIC (VDX7B37674)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
				<key>input_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
