<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Blurb InDesign plugin package and builds an InDesign version-specific package.

NOTE:
- An override to this recipe makes the most sense when it is version specific, e.g. "autopkg make-override Blurb.pkg -n BlurbCC2018.pkg"
- INDESIGN_APP_VERSION must be overridden with a string that matches the targeted version of InDesign.  Current (as of 2020-4-20) supported version strings are:

2020
CC
CC 2014
CC 2015
CC 2017
CC 2018
CC 2019
CS3
CS4
CS5
CS5.5
CS6

- PACKAGE_ID must be overridden, preferably with a version-specific package ID, e.g. "com.blurb.BlurbCC2018.pkg"
- PACKAGE_NAME must be overridden, preferably with a version-specific package name, e.g. "BlurbCC2018"</string>
	<key>Identifier</key>
	<string>com.github.lincolnep.recipes.pkg.Blurb</string>
	<key>Input</key>
	<dict>
		<key>INDESIGN_APP_VERSION</key>
		<string>2020</string>
		<key>PACKAGE_ID</key>
		<string>com.blurb.Blurb%INDESIGN_APP_VERSION%.pkg</string>
		<key>PACKAGE_NAME</key>
		<string>Blurb%INDESIGN_APP_VERSION%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.lincolnep.recipes.download.Blurb</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>INDESIGN_APP_VERSION == "app_version"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>PACKAGE_ID == "com.blurb.BlurbVERSION.pkg"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>predicate</key>
				<string>PACKAGE_NAME == "BlurbVERSION"</string>
			</dict>
			<key>Processor</key>
			<string>StopProcessingIf</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/BBC_MultiVers_Installer.pkg/Payload</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/%INDESIGN_APP_VERSION%/BlurbBookCreator.InDesignPlugin/Versions/A/Resources/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot/Applications/Adobe InDesign %INDESIGN_APP_VERSION%/Plug-Ins/Blurb Book Creator/BlurbBookCreator.InDesignPlugin</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/%INDESIGN_APP_VERSION%/BlurbBookCreator.InDesignPlugin</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
						<dict>
							<key>group</key>
							<string>wheel</string>
							<key>path</key>
							<string>Applications/Adobe InDesign %INDESIGN_APP_VERSION%/Plug-Ins</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%PACKAGE_ID%</string>
					<key>pkgname</key>
					<string>%PACKAGE_NAME%-%version%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					<key>pkgtype</key>
					<string>flat</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
