<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Splashtop SOS and builds a package.</string>
    <key>Identifier</key>
    <string>com.github.lincolnep.recipes.pkg.SplashtopSOS</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Splashtop SOS</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.lincolnep.recipes.download.SplashtopSOS</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Splashtop SOS.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleVersion</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/SplashtopSOS-%version%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
        </dict>
    </array>
</dict>
</plist>
