<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Creates a pkg to install the latest version of Rhinoceros.</string>
	<key>Identifier</key>
	<string>com.github.lincolnep.recipes.pkg.Rhinocerosnotworking</string>
	<key>Input</key>
	<dict/>
	<key>MinimumVersion</key>
	<string>1.0.3</string>
	<key>ParentRecipe</key>
	<string>com.github.lincolnep.recipes.download.Rhinoceros</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict/>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
