<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Thunderbird disk image and builds a package.
Some useful values for RELEASE are: 'latest', 'beta-latest'.
LOCALE controls the language localization to be downloded.
Examples include 'en-US', 'de', 'sv-SE', and 'zh-TW'
See the following URLs for more info:
    http://ftp.mozilla.org/pub/thunderbird/releases/latest/README.txt
    http://ftp.mozilla.org/pub/thunderbird/releases/latest-beta/README.txt</string>
	<key>Identifier</key>
	<string>com.github.lincolnep.recipes.pkg.Thunderbird</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Thunderbird</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.thunderbird</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
