<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Cisco Jabber from a local file share.</string>
	<key>Identifier</key>
	<string>com.github.lincolnep.recipes.CiscoJabber</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cisco Jabber</string>
		<key>SEARCH_STRING</key>
		<string>Cisco Jabber</string>
		<key>MAJOR_VERSION</key>
		<string></string>
		<key>NAME_LIMITATION</key>
		<string></string>
		<key>NAME_EXCEPTION</key>
		<string>testing</string>
		<key>FILE_SHARE</key>
		<string>/path/to/offline/repository</string>
        <key>VERSION_STRING_SEPARATOR</key>
        <string>-</string>
		<key>MAX_FOLDER_DEPTH</key>
		<string>1</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.lincolnep.recipes.SharedProcessors/OfflineApps</string>
			<key>Arguments</key>
			<dict>
				<key>search_path</key>
				<string>%FILE_SHARE%</string>
				<key>search_string</key>
				<string>%SEARCH_STRING%</string>
				<key>major_version</key>
				<string>%MAJOR_VERSION%</string>
				<key>exception_string</key>
				<string>%NAME_EXCEPTION%</string>
				<key>limitation_string</key>
				<string>%NAME_LIMITATION%</string>
				<key>version_separator</key>
				<string>%VERSION_STRING_SEPARATOR%</string>
				<key>max_depth</key>
				<string>%MAX_FOLDER_DEPTH%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%cached_path%/*.zip</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%found_filename%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>purge_destination</key>
                <true />
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>FileFinder</string>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/unpack/*.pkg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/XarExtractSingleFile</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%found_filename%</string>
				<key>file_to_extract</key>
				<string>Distribution</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.mlbz521.SharedProcessors/XPathParser</string>
			<key>Arguments</key>
			<dict>
				<key>xml_file</key>
				<string>%extracted_file%</string>
				<key>xpath</key>
				<string>./pkg-ref[@id="com.cisco.Jabber"]/bundle-version/bundle</string>
				<key>attribute_one</key>
				<string>CFBundleShortVersionString</string>
				<key>return_variable_attribute_one</key>
				<string>version</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/*.pkg</string>
				<key>exepected_authority_names</key>
				<array>
					<string>Developer ID Installer: Cisco (DE8Y96K9QP)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
