<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Packages disk image.</string>
	<key>Identifier</key>
	<string>com.github.lincolnep.recipes.download.Packages</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Packages</string>
		<key>DOWNLOAD_URL</key>
		<string>http://s.sudre.free.fr/Software/files/Packages.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/packages/Packages.pkg</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Stephane Sudre (NL5M9E394P)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/installer_unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/packages/Packages.pkg</string>
				<key>purge_destination</key>
				<true />
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
            </dict>
        	<dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                <key>pattern</key>
              		<string>%RECIPE_CACHE_DIR%/installer_unpack/*.pkg</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/installer_payload</string>
                    <key>pkg_payload_path</key>
                    <string>%found_filename%/Payload</string>
                    <key>purge_destination</key>
                    <true />
                </dict>
                <key>Processor</key>
                <string>PkgPayloadUnpacker</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%RECIPE_CACHE_DIR%/installer_payload/Applications/Packages.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>path_list</key>
                    <array>
                        <string>%RECIPE_CACHE_DIR%/installer_payload/</string>
                        <string>%RECIPE_CACHE_DIR%/installer_unpack/</string>
                    </array>
                </dict>
                <key>Processor</key>
                <string>PathDeleter</string>
            </dict>
	</array>
</dict>
</plist>
